Revit 2025 API
TemporaryGraphicsManager Methods
The TemporaryGraphicsManager type exposes the following members.
Methods
Name | Description
AddControl |  Creates an in-canvas control.
Clear |  Clear all temporary graphics objects managed by this manager.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAll |  Returns all temporary graphics object indexes managed by this manager.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTemporaryGraphicsManager |  Gets a TemporaryGraphicsManager reference of the document.
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveControl |  Deletes the existing control identified by the unique index.
SetVisibility |  Changes the visibility of temporary graphics object.
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateControl |  Updates the in-canvas control identified by the unique index.
Top
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace